{"class_name": "Functional", "config": {"name": "InceptionTimeNetV4-D05-new", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 7500, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "ecg_input"}, "name": "ecg_input", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "Conv1_1", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [8], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1_1", "inbound_nodes": [[["ecg_input", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv2_1", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [16], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2_1", "inbound_nodes": [[["ecg_input", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv3_1", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [32], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv3_1", "inbound_nodes": [[["ecg_input", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv4_1", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [64], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv4_1", "inbound_nodes": [[["ecg_input", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1_1", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1_1", "inbound_nodes": [[["Conv1_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2_1", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2_1", "inbound_nodes": [[["Conv2_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN3_1", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN3_1", "inbound_nodes": [[["Conv3_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN4_1", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN4_1", "inbound_nodes": [[["Conv4_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU1_1", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU1_1", "inbound_nodes": [[["BN1_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU2_1", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU2_1", "inbound_nodes": [[["BN2_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU3_1", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU3_1", "inbound_nodes": [[["BN3_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU4_1", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU4_1", "inbound_nodes": [[["BN4_1", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPool_1", "trainable": false, "dtype": "float32", "strides": [1], "pool_size": [8], "padding": "same", "data_format": "channels_last"}, "name": "MaxPool_1", "inbound_nodes": [[["ecg_input", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop1_1", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop1_1", "inbound_nodes": [[["ReLU1_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop2_1", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop2_1", "inbound_nodes": [[["ReLU2_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop3_1", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop3_1", "inbound_nodes": [[["ReLU3_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop4_1", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop4_1", "inbound_nodes": [[["ReLU4_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv_skip_1", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv_skip_1", "inbound_nodes": [[["MaxPool_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Concat_1", "trainable": false, "dtype": "float32", "axis": -1}, "name": "Concat_1", "inbound_nodes": [[["Drop1_1", 0, 0, {}], ["Drop2_1", 0, 0, {}], ["Drop3_1", 0, 0, {}], ["Drop4_1", 0, 0, {}], ["Conv_skip_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1_2", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [8], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1_2", "inbound_nodes": [[["Concat_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv2_2", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [16], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2_2", "inbound_nodes": [[["Concat_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv3_2", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [32], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv3_2", "inbound_nodes": [[["Concat_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv4_2", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [64], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv4_2", "inbound_nodes": [[["Concat_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1_2", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1_2", "inbound_nodes": [[["Conv1_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2_2", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2_2", "inbound_nodes": [[["Conv2_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN3_2", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN3_2", "inbound_nodes": [[["Conv3_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN4_2", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN4_2", "inbound_nodes": [[["Conv4_2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU1_2", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU1_2", "inbound_nodes": [[["BN1_2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU2_2", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU2_2", "inbound_nodes": [[["BN2_2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU3_2", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU3_2", "inbound_nodes": [[["BN3_2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU4_2", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU4_2", "inbound_nodes": [[["BN4_2", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPool_2", "trainable": false, "dtype": "float32", "strides": [1], "pool_size": [8], "padding": "same", "data_format": "channels_last"}, "name": "MaxPool_2", "inbound_nodes": [[["Concat_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop1_2", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop1_2", "inbound_nodes": [[["ReLU1_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop2_2", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop2_2", "inbound_nodes": [[["ReLU2_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop3_2", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop3_2", "inbound_nodes": [[["ReLU3_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop4_2", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop4_2", "inbound_nodes": [[["ReLU4_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv_skip_2", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv_skip_2", "inbound_nodes": [[["MaxPool_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Concat_2", "trainable": false, "dtype": "float32", "axis": -1}, "name": "Concat_2", "inbound_nodes": [[["Drop1_2", 0, 0, {}], ["Drop2_2", 0, 0, {}], ["Drop3_2", 0, 0, {}], ["Drop4_2", 0, 0, {}], ["Conv_skip_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1_3", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [8], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1_3", "inbound_nodes": [[["Concat_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv2_3", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [16], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2_3", "inbound_nodes": [[["Concat_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv3_3", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [32], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv3_3", "inbound_nodes": [[["Concat_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv4_3", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [64], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv4_3", "inbound_nodes": [[["Concat_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1_3", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1_3", "inbound_nodes": [[["Conv1_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2_3", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2_3", "inbound_nodes": [[["Conv2_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN3_3", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN3_3", "inbound_nodes": [[["Conv3_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN4_3", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN4_3", "inbound_nodes": [[["Conv4_3", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU1_3", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU1_3", "inbound_nodes": [[["BN1_3", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU2_3", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU2_3", "inbound_nodes": [[["BN2_3", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU3_3", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU3_3", "inbound_nodes": [[["BN3_3", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU4_3", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU4_3", "inbound_nodes": [[["BN4_3", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPool_3", "trainable": false, "dtype": "float32", "strides": [1], "pool_size": [8], "padding": "same", "data_format": "channels_last"}, "name": "MaxPool_3", "inbound_nodes": [[["Concat_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop1_3", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop1_3", "inbound_nodes": [[["ReLU1_3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop2_3", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop2_3", "inbound_nodes": [[["ReLU2_3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop3_3", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop3_3", "inbound_nodes": [[["ReLU3_3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop4_3", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop4_3", "inbound_nodes": [[["ReLU4_3", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv_skip_3", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv_skip_3", "inbound_nodes": [[["MaxPool_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Concat_3", "trainable": false, "dtype": "float32", "axis": -1}, "name": "Concat_3", "inbound_nodes": [[["Drop1_3", 0, 0, {}], ["Drop2_3", 0, 0, {}], ["Drop3_3", 0, 0, {}], ["Drop4_3", 0, 0, {}], ["Conv_skip_3", 0, 0, {}]]]}, {"class_name": "ZeroPadding1D", "config": {"name": "Pad_4", "trainable": false, "dtype": "float32", "padding": [0, 1]}, "name": "Pad_4", "inbound_nodes": [[["Concat_3", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1_4", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [8], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1_4", "inbound_nodes": [[["Pad_4", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv2_4", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [16], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2_4", "inbound_nodes": [[["Pad_4", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv3_4", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [32], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv3_4", "inbound_nodes": [[["Pad_4", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv4_4", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [64], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv4_4", "inbound_nodes": [[["Pad_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1_4", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1_4", "inbound_nodes": [[["Conv1_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2_4", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2_4", "inbound_nodes": [[["Conv2_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN3_4", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN3_4", "inbound_nodes": [[["Conv3_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN4_4", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN4_4", "inbound_nodes": [[["Conv4_4", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU1_4", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU1_4", "inbound_nodes": [[["BN1_4", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU2_4", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU2_4", "inbound_nodes": [[["BN2_4", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU3_4", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU3_4", "inbound_nodes": [[["BN3_4", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU4_4", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU4_4", "inbound_nodes": [[["BN4_4", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPool_4", "trainable": false, "dtype": "float32", "strides": [1], "pool_size": [8], "padding": "same", "data_format": "channels_last"}, "name": "MaxPool_4", "inbound_nodes": [[["Pad_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop1_4", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop1_4", "inbound_nodes": [[["ReLU1_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop2_4", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop2_4", "inbound_nodes": [[["ReLU2_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop3_4", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop3_4", "inbound_nodes": [[["ReLU3_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop4_4", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop4_4", "inbound_nodes": [[["ReLU4_4", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv_skip_4", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv_skip_4", "inbound_nodes": [[["MaxPool_4", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Concat_4", "trainable": false, "dtype": "float32", "axis": -1}, "name": "Concat_4", "inbound_nodes": [[["Drop1_4", 0, 0, {}], ["Drop2_4", 0, 0, {}], ["Drop3_4", 0, 0, {}], ["Drop4_4", 0, 0, {}], ["Conv_skip_4", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1_5", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [8], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1_5", "inbound_nodes": [[["Concat_4", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv2_5", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [16], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2_5", "inbound_nodes": [[["Concat_4", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv3_5", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [32], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv3_5", "inbound_nodes": [[["Concat_4", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv4_5", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [64], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv4_5", "inbound_nodes": [[["Concat_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1_5", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1_5", "inbound_nodes": [[["Conv1_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2_5", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2_5", "inbound_nodes": [[["Conv2_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN3_5", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN3_5", "inbound_nodes": [[["Conv3_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN4_5", "trainable": false, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN4_5", "inbound_nodes": [[["Conv4_5", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU1_5", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU1_5", "inbound_nodes": [[["BN1_5", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU2_5", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU2_5", "inbound_nodes": [[["BN2_5", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU3_5", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU3_5", "inbound_nodes": [[["BN3_5", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "ReLU4_5", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "ReLU4_5", "inbound_nodes": [[["BN4_5", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPool_5", "trainable": false, "dtype": "float32", "strides": [1], "pool_size": [8], "padding": "same", "data_format": "channels_last"}, "name": "MaxPool_5", "inbound_nodes": [[["Concat_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop1_5", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop1_5", "inbound_nodes": [[["ReLU1_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop2_5", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop2_5", "inbound_nodes": [[["ReLU2_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop3_5", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop3_5", "inbound_nodes": [[["ReLU3_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop4_5", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop4_5", "inbound_nodes": [[["ReLU4_5", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv_skip_5", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv_skip_5", "inbound_nodes": [[["MaxPool_5", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Concat_5", "trainable": false, "dtype": "float32", "axis": -1}, "name": "Concat_5", "inbound_nodes": [[["Drop1_5", 0, 0, {}], ["Drop2_5", 0, 0, {}], ["Drop3_5", 0, 0, {}], ["Drop4_5", 0, 0, {}], ["Conv_skip_5", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "AvgPool", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "AvgPool", "inbound_nodes": [[["Concat_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "FC_6", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "FC_6", "inbound_nodes": [[["AvgPool", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop_6", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "Drop_6", "inbound_nodes": [[["FC_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "FC_7", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "FC_7", "inbound_nodes": [[["Drop_6", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Drop_7", "trainable": false, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Drop_7", "inbound_nodes": [[["FC_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "FC_8", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "FC_8", "inbound_nodes": [[["Drop_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "FC_New", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "FC_New", "inbound_nodes": [[["FC_8", 0, 0, {}]]]}], "input_layers": [["ecg_input", 0, 0]], "output_layers": [["FC_New", 0, 0]]}, "keras_version": "2.10.0", "backend": "tensorflow"}